#include<bits/stdc++.h>
using namespace std;
int main()
{
	freopen("meow.out","w",stdout);
	cout<<"Long Live the Reed!";
	return 0;
}

































































































































/*
plant.cpp 

 究竟我化作了**的令箭 还是已化作了争权的铺垫
 所做的决议已然转发多变 选择性去执行指示悄异变
 绿色田野计划将批准实现 *****需***经验
 规范化等*hua分层层te权 推物**励指派**成员
 
 我再次投身在那gm中未敢忘誓言
 
 罗格河争斗 招致总**出手
 *安**压在ye猫*工后
 工人yx久 城市企业禁诉求
 谁人倡团结为无产者领袖
 *红xian*流 重建**与*朽
 尘埃落定以后井然秩序留
 一切***在前密谋 **万事休
 
 剑指*中* 以**斗*为纲
 掀新**** 鼓动***
 五十天** 引******
 **运动** 分化**忙
 各**争僵 gm无力再执掌
 半生时光虚晃 皆东付大洋
 寿终正寝关入*** 重拳出击*****
 促体**革*行*向 全民*化海殇
*/
